///////////////////////////////////////////////////////////Тема 1//////////////////////////////////////////////////////////////

// Написати кілька інструкцій із даними різних типів.
// Наприклад, складіть рядки, рядок з числом, число з булевим значенням і так далі

// Рядок 
var myString = "Це приклад рядка";

// Число 
var myNumber = 42;

// Булеве значення 
var myBoolean = true;

// Null
var myNull = null;

// Undefined
var myUndefined;

// Виведення даних в консоль
console.log("Рядок:", myString);
console.log("Число:", myNumber);
console.log("Булеве значення:", myBoolean);
console.log("Null:", myNull);
console.log("Undefined:", myUndefined);



///////////////////////////////////////////////////////////////////Тема 2///////////////////////////////////////////////////////

// Завдання 1 Постфіксна та префіксна форми

let a = 1, b = 1;

alert( ++a ); // 2
alert( b++ ); // 1

alert( a ); // 2
alert( b ); // 2 

// Завдання 2 Результат присвоєння

let a = 2;

let x = 1 + (a *= 2);

//Відповідь: a = 4, b = 5


// Завдання 3 Перетворення типу

"" + 1 + 0 = "10" 
"" - 1 + 0 = -1 
true + false = 1
6 / "3" = 2
"2" * "3" = 6
4 + 5 + "px" = "9px"
"$" + 4 + 5 = "$45"
"4" - 2 = 2
"4px" - 2 = NaN
"  -9  " + 5 = "  -9  4" 
"  -9  " - 5 = -14 
null + 1 = 1 
undefined + 1 = NaN 
" \t \n" - 2 = -2 


// Завдання 4 Виправте додавання

let a = prompt("Перше число?", 1);
let b = prompt("Друге число?", 2);

alert(+a + +b); 

// ТУТ  буде відповідь 3