////////////////////////////////////////////////////////////Завдання 1 //////////////////////////////////////////////////////

// Чи буде показано alert?

// if ("0") {
//   alert( 'Привіт' );
// }

// Так буде

////////////////////////////////////////////////////////////Завдання 2 //////////////////////////////////////////////////////

// Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’
// Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”

let company = prompt("Яка офіційна назва Js?", "");

if (company == "ECMAScript") {
  alert("Так все вірно!");
} else {
  alert("Ви не знаєте? ECMAScript!");
}

// Практика 1

let answer = prompt("Як звуть засновника JavaScript?", "");

let correctName =
  answer == "Brendan Eich"
    ? "Все вірно!"
    : "Неправильно, правильна відповідь - Brendan Eich";

alert(correctName);

// Практика 2

let zima = prompt("Яка зараз пора року?", "");

if (zima == "Зима") {
  console.log("Харош шо сказати орінтуєшся!)");
} else {
  console.log("Ти шо патєряний ? Зараз зима)");
}

// Логічні оператори

// тут я пишу просто щоб перевірити як це працює можеш не читати
let hour = 12;
let isWeekend = true;

if (hour < 10 || hour > 21 || isWeekend) {
  alert("Офіс зачинений."); // це вихідні
}

// Завданян 1

alert(null || 2 || undefined);
// тут виведеться 2, томущо всі решта хибні а тут використовується ||(АБО)

// Завдання 2

alert(alert(1) || 2 || alert(3));
// тут буде 2

// Завданння 3

alert(1 && null && 2);
// Відповідь: null

// Завдання 4

alert(alert(1) && alert(2));
// Відповідь: 1, а потім undefined.

// Завдання 5

alert(null || (2 && 3) || 4);
// Відповідь: 3

// Завдання 6

// Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.
// “Включно” означає, що age може досягати країв 14 або 90.

if (age >= 14 && age <= 90);

// Завдання 7

// Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно.
// Створіть два варіанти: перший з оператором НЕ !, другий — без нього.

if (!(age >= 14 && age <= 90));

// Завдання 8

// Які з цих alert буде виконано?
if (-1 || 0) alert("перший");
if (-1 && 0) alert("другий");
if (null || (-1 && 1)) alert("третій");

// Відповідь: перший і третій виконаються

// Задання 9 НАЙСКЛАДНІШЕ

alert("Стук стук");

let userName = prompt("Хто там?", "");

if (userName === "Admin") {
  let pass = prompt("Пароль?", "");

  if (pass === "Господар") {
    alert("Ласкаво просимо!");
  } else if (pass === "" || pass === null) {
    alert("Ну ок я вже скасовую");
  } else {
    alert("Неправильний пароль! Ти можеш ввести правильний?");
  }
} else if (userName === "" || userName === null) {
  alert("Ну ок я вже скасовую");
} else {
  alert("Ти хто я тебе не знаю чоловіче");
}
