// Завдання 1

// Яке останнє значення буде виведено на екран? Чому?
let i = 3;

while (i) {
  alert(i--);
}

// Відповідь: 1, томущо кожна ітерація циклу зменшує i на 1.

// Завдання 2

// Відповідь: Перший цикл виведе числа від 1 до 4 а другий цикл виведе числа від 1 до 5.

// Завдання 3

// Відповідь: Перше значинння виведе від 0 до 4 а друга таксамо.

// Завдання 4

for (let i = 0; i <= 10; i++) {
  if (i % 2 == 0) {
    alert(i);
  }
}

// Завдання 5

// Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).
for (let i = 0; i < 3; i++) {
  alert(`число ${i}!`);
}

let i = 0; // тут i підсвідчується червоним томущо вище вже створював таку зміну
while (i < 3) {
  alert(`число ${i}!`);
  i++;
}

// Завдання 6

// Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.
// Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.
// Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення не-числового введення.

// Рішеня:

let num;

do {
  num = prompt("Введіть чисто більше за 100", 0);
} while (num <= 100 && num);

// Задання 8

// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.
// Для n = 10 результат повинен бути 2,3,5,7.

// Рішення:

let n = 10;

nextPrime: 
for (let i = 2; i <= n; i++) {
  for (let j = 2; j < i; j++) {
    if (i % j == 0) continue nextPrime;
  }
  alert(i);
}
