// Завдання 1

// Чи потрібен "else"?
// Наступна функція повертає true, якщо параметр age більший за 18.
// Інакше вона запитує підтвердження через confirm і повертає його результат:

function checkAge(age) {
  if (age > 18) {
    return true;
  } else {
    // ...
    return confirm("Батьки дозволили?");
  }
}
// Чи буде функція працювати по-іншому, якщо забрати else?

function checkAge(age) {
  if (age > 18) {
    return true;
  }
  // ...
  return confirm("Батьки дозволили?");
}
// Чи є різниця в поведінці цих двох варіантів?

// Відповідь: Нема різниці

// Завдання 2

// Перепишіть функцію, використовуючи '?' або '||'
// Наступна функція повертає true, якщо параметр age більший за 18.
// Інакше вона запитує підтвердження через confirm і повертає його результат:

function checkAge(age) {
  if (age > 18) {
    return true;
  } else {
    return confirm("Батьки дозволили?");
  }
}
// Перепишіть функцію, щоб вона робила теж саме, але без if і в один рядок.

// Зробіть два варіанти функції checkAge:
// Використовуючи оператор ?
// Використовуючи оператор АБО ||

// Рішення:

// Використовуючи "?"

function checkAge(age) {
  return age > 18 ? true : confirm("Батьки дозволили?");
}

// Використовуючи "||"

function checkAge(age) {
  return age > 18 || confirm("Батьки дозволили?");
}

// Завдання 3

// Функція min(a, b)
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.
// Наприклад:
min(2, 5) == 2;
min(3, -1) == -1;
min(1, 1) == 1;

// Рішення:
function min(a, b) {
  if (a < b) {
    return a;
  } else {
    return b;
  }
}

// Завдання 4:

function pow(x, n) {
  let result = x;

  for (let i = 1; i < n; i++) {
    result *= x;
  }
  return result;
}
let x = prompt("x?", "");
let n = prompt("n?", "");

if (n < 1) {
  alert(`Степінь ${n} не підтримується, використовуйте натуральне число`);
} else {
  alert(pow(x, n));
}

// Чесно скажу не знав як зробити завдання 4 доки не подивився відповідь відповідь скопіював з сайту але я більш менш зрозуимів як це зробити
